Reports/УнифицированнаяФормаП13.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>УнифицированнаяФормаП13</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РабочееВремяРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>РабочееВремяРаботниковОрганизаций</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СводнаяЗапись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЦеломЗаПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Comment>Это либо Сотрудник, либо Внутренний совместитель, либо Сотрудник которого Заменяем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИспользованияРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ГрафикиРаботыПоВидамВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыПоВидамВремени</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновноеЗначение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительноеЗначение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДни</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйКалендарьКалендарныеДниСПраздниками</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыУчетаВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыУчетаВремени</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДням</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВечернимЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНочнымЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/УнифицированнаяФормаП13/Ext/ObjectModule.bsl
#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем НП Экспорт;  				  // Настройка периода

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

// Функция разбивает строку на символы
// и помещает их в структуру
//
// Параметры
// 	СтрокаСимволов – Тип: Строка или преобразуемый к ней – Строка, которую нужно разбить
//                 
//  ИмяКлючей      – Тип: Строка – Наименование ключей структуры.
//                                 Например: 
//                                 "ИНН" - функция вернет структуру ИНН1...ИНН<КоличествоСимволов>
//                 
//
// Возвращаемое значение:
//   Тип: Структура – с наименованием ключей <ИмяКлючей> + <НомерСимвола>   
//                    и значениями символов строки
//
Функция РазбитьСтрокуНаСимволы(Знач СтрокаСимволов, ИмяКлючей) Экспорт
	
	СтруктураСимволов = Новый Структура;
	
	Попытка
	
		СтрокаСимволов = Строка(СтрокаСимволов)
	
	Исключение
		
		Возврат СтруктураСимволов
	
	КонецПопытки;

	Для Н = 1 По СтрДлина(СтрокаСимволов) Цикл
	
		СтруктураСимволов.Вставить(ИмяКлючей + Н, Сред(СтрокаСимволов, Н, 1));		
	
	КонецЦикла;
	
	Возврат СтруктураСимволов
	

КонецФункции // РазбитьСтрокуНаСимволы()




////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 
// 
Процедура СформироватьОтчет(ДокументРезультат) Экспорт
	
	НачМесяца = НачалоМесяца(ДатаНач);
	КонМесяца = КонецМесяца(ДатаНач);
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	                      |ИЗ
	                      |	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	                      |
	                      |ГДЕ
	                      |	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаС И &ДатаПо");
						   
	Запрос.УстановитьПараметр("ДатаС",  НачМесяца);
	Запрос.УстановитьПараметр("ДатаПо", КонМесяца);
	
	Если Запрос.Выполнить().Выбрать().Количество() = 0 Тогда
		
		Сообщить(НСтр("ru='Перед формированием отчета заполните ""Регламентированный производственный календарь"" за ';uk='Перед формуванням звіту заповніть ""Регламентований виробничий календар"" за '")
		         + Формат(ДатаНач,"ДФ=yyyy") + НСтр("ru=' год!';uk=' рік!'"));
		Возврат;
		
	КонецЕсли;
	
	ОтборОрганизации   = ТипЗнч(СохраненныеНастройки) = Тип("Структура");
	ОтборРаботника     = ОтборОрганизации;
	ОтборПодразделение = ОтборОрганизации;

	Если ОтборОрганизации Тогда
		
		ОтборОрганизации		  = СохраненныеНастройки.ФлажокНастройкиОрганизация;
		ВидСравненияОрганизации	  = СохраненныеНастройки.ПолеВидаСравненияОрганизация;
		Организация				  = СохраненныеНастройки.ПолеНастройкиОрганизация;
		ОтборРаботника			  = СохраненныеНастройки.ФлажокНастройкиРаботник;
		ВидСравненияРаботника	  = СохраненныеНастройки.ПолеВидаСравненияРаботник;
		Работник				  = СохраненныеНастройки.ПолеНастройкиРаботник;
		ОтборПодразделение		  = СохраненныеНастройки.ФлажокНастройкиПодразделение;
		ВидСравненияПодразделение = СохраненныеНастройки.ПолеВидаСравненияПодразделение;
		Подразделение			  = СохраненныеНастройки.ПолеНастройкиПодразделение;
		
	КонецЕсли; 
	
	ДокументРезультат.Очистить();
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
    ДокументРезультат.ПолеСлева          = 5;
	ДокументРезультат.ПолеСправа         = 5;
	
	ЗапросТабель = Новый Запрос();
	ЗапросТабель.УстановитьПараметр("Месяц",				  ДатаНач);
	ЗапросТабель.УстановитьПараметр("НачалоМесяца", 		  ДатаНач);
	ЗапросТабель.УстановитьПараметр("ОкончаниеМесяца", 		  КонецМесяца(ДатаНач));
	ЗапросТабель.УстановитьПараметр("НеуказанноеОбозначение", Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка());
	ЗапросТабель.УстановитьПараметр("ПоДням",				  Перечисления.ВидыУчетаВремени.ПоДням);
	ЗапросТабель.УстановитьПараметр("ВидВремениПустаяСсылка", Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка());
	
	ЗапросТабель.УстановитьПараметр("Явка", Справочники.КлассификаторИспользованияРабочегоВремени.Работа);
	ЗапросТабель.УстановитьПараметр("Выходной", Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни);
	ЗапросТабель.УстановитьПараметр("ПоНочнымЧасам", Перечисления.ВидыУчетаВремени.ПоНочнымЧасам);
	ЗапросТабель.УстановитьПараметр("НочныеЧасы", Справочники.КлассификаторИспользованияРабочегоВремени.Ночные);
	ЗапросТабель.УстановитьПараметр("ПоВечернимЧасам", Перечисления.ВидыУчетаВремени.ПоВечернимЧасам);
	ЗапросТабель.УстановитьПараметр("ВечерниеЧасы", Справочники.КлассификаторИспользованияРабочегоВремени.Вечерние);
	ЗапросТабель.УстановитьПараметр("ПоЧасам", Перечисления.ВидыУчетаВремени.ПоЧасам);
	ЗапросТабель.УстановитьПараметр("ПриемНаРаботу", Перечисления.ПричиныИзмененияСостояния.ПриемНаРаботу);
	ЗапросТабель.УстановитьПараметр("Увольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	ЗапросТабель.УстановитьПараметр("ПоДням", Перечисления.ВидыУчетаВремени.ПоДням);
	ЗапросТабель.УстановитьПараметр("Работает", Перечисления.СостоянияРаботникаОрганизации.Работает);
	ЗапросТабель.УстановитьПараметр("Заболевание", Перечисления.СостоянияРаботникаОрганизации.Заболевание);
	ЗапросТабель.УстановитьПараметр("Больничный", Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь);
	ЗапросТабель.УстановитьПараметр("ВидВремениПустаяСсылка", Справочники.КлассификаторИспользованияРабочегоВремени.ПустаяСсылка());
	
	СписокЦелодневноеНеотработанное = Новый СписокЗначений; //Заменяет перечисление ВидВремени со значением "Целодневное неотработнанное"
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Болезнь);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателяВнутрисменный);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоЗаконодательству);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ПростоиПоВинеРаботников);
	СписокЦелодневноеНеотработанное.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.ПростоиПоВинеРаботниковВнутрисменные);
	
	СписокСверхНормы = Новый СписокЗначений; //Заменяет перечисление ВидВремени со значением "ОтработанноеСверхНормы"
	СписокСверхНормы.Добавить(Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные);
	
	ЗапросТабель.УстановитьПараметр("ОтработаноСверхНормы", СписокСверхНормы);
	ЗапросТабель.УстановитьПараметр("ЦелодневноеНеотработанное", СписокЦелодневноеНеотработанное);
	
	УсловиеВЗапрос = "";
	Если ОтборОрганизации Тогда
		
		Если ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
			ЗапросТабель.УстановитьПараметр("Организация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Иначе
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВЫБОР
			|		КОГДА Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
			|			ТОГДА Организации.Ссылка
			|		ИНАЧЕ Организации.ГоловнаяОрганизация
			|	КОНЕЦ КАК Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Ссылка В(&Организация)");
			
			Запрос.УстановитьПараметр("Организация", Организация);
			ЗапросТабель.УстановитьПараметр("Организация", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		КонецЕсли;

		ВидСравненияОрганизация = УправлениеОтчетами.ПолучитьВидСравненияСтрокой(ВидСравненияОрганизации);
		Если ВидСравненияОрганизации = ВидСравнения.Равно ИЛИ ВидСравненияОрганизации = ВидСравнения.НеРавно Тогда
			УсловиеНаОрганизации = " Организация " + ВидСравненияОрганизация + " &Организация";
		Иначе
			УсловиеНаОрганизации = " Организация " + ВидСравненияОрганизация + " (&Организация)";
		КонецЕсли;
		УсловиеВЗапрос = УсловиеВЗапрос + " И " + УсловиеНаОрганизации;
	КонецЕсли;
	
	Если ОтборПодразделение Тогда
		
		ЗапросТабель.УстановитьПараметр("ПодразделениеОрганизации", Подразделение);
		ВидСравненияПодразделения = УправлениеОтчетами.ПолучитьВидСравненияСтрокой(ВидСравненияПодразделение);
		
		Если ВидСравненияПодразделения = ВидСравнения.Равно ИЛИ ВидСравненияПодразделения = ВидСравнения.НеРавно Тогда
			УсловиеПодразделение = " ПодразделениеОрганизации " + ВидСравненияПодразделения + " &ПодразделениеОрганизации";
		Иначе
			УсловиеПодразделение = " ПодразделениеОрганизации " + ВидСравненияПодразделения + " (&ПодразделениеОрганизации)";
		КонецЕсли;
		
		УсловиеВЗапрос = УсловиеВЗапрос + " И " + УсловиеПодразделение;
	КонецЕсли;
	
	Если ОтборРаботника Тогда
		
		ЗапросТабель.УстановитьПараметр("РаботникиОрганизации", Работник);
		ВидСравненияРаботник = УправлениеОтчетами.ПолучитьВидСравненияСтрокой(ВидСравненияРаботника);
		
		Если ВидСравненияРаботник = "=" ИЛИ ВидСравненияРаботник = "<>" Тогда
			УсловиеПоРаботникам	= " Сотрудник " + ВидСравненияРаботник + " &РаботникиОрганизации";
		Иначе
			УсловиеПоРаботникам	= " Сотрудник " + ВидСравненияРаботник + "(&РаботникиОрганизации)";
		КонецЕсли;	
	КонецЕсли; 
	
	ЗапросТабель.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросТабель.Текст ="
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	РаботникиОрганизаций.Сотрудник,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ВЫБОР
	|		КОГДА ФИОФизЛицСрезПоследних.Имя = """"
	|			ТОГДА """"
	|		ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "". ""
	|	КОНЕЦ + ВЫБОР
	|		КОГДА ФИОФизЛицСрезПоследних.Отчество = """"
	|			ТОГДА """"
	|		ИНАЧЕ ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
	|	КОНЕЦ, РаботникиОрганизаций.Сотрудник.Физлицо.Наименование) КАК СотрудникНаименование,
	|	ДолжностиРаботников.Организация КАК Организация,
	|	ДолжностиРаботников.ПодразделениеОрганизации,
	|	ДолжностиРаботников.Должность
	|ПОМЕСТИТЬ ВТСотрудники
		|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РаботникиОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
	|		РаботникиОрганизацийСрезПоследних.Организация КАК Организация
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоМесяца, " + ?(ПустаяСтрока(УсловиеПоРаботникам),УсловиеНаОрганизации,УсловиеПоРаботникам) + ") КАК РаботникиОрганизацийСрезПоследних
	|	ГДЕ
	|		РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|	
	|	ОБЪЕДИНИТЬ 
	|	
	|	ВЫБРАТЬ
	|		РаботникиОрганизаций.Сотрудник,
	|		РаботникиОрганизаций.Организация
	|	ИЗ
	|		РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|	ГДЕ
	|		РаботникиОрганизаций.Период > &НачалоМесяца
	|		И РаботникиОрганизаций.Период < &ОкончаниеМесяца
	|		И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		&ОкончаниеМесяца,
	|		ФизЛицо В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				СотрудникиОрганизаций.Физлицо
	|			ИЗ
	|				Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|			ГДЕ
	|				ИСТИНА " +  ?(ПустаяСтрока(УсловиеПоРаботникам),?(ПустаяСтрока(УсловиеНаОрганизации),""," И " + УсловиеНаОрганизации)," И " + СтрЗаменить(УсловиеПоРаботникам,"Сотрудник","Ссылка")) + ")) КАК ФИОФизЛицСрезПоследних
	|		ПО ФИОФизЛицСрезПоследних.ФизЛицо = РаботникиОрганизаций.Сотрудник.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ОкончаниеМесяца, " + ?(ПустаяСтрока(УсловиеПоРаботникам),УсловиеНаОрганизации,УсловиеПоРаботникам) + ") Как ДолжностиРаботников
	|		ПО ДолжностиРаботников.Сотрудник = РаботникиОрганизаций.Сотрудник
	|ГДЕ
	|	ИСТИНА
	|" + ?(ОтборОрганизации, " И ДолжностиРаботников.Организация " + ВидСравненияОрганизация + "(&Организация)", " ") + "
	|" + ?(ОтборПодразделение, " И ДолжностиРаботников.ПодразделениеОрганизации " + ВидСравненияПодразделения + "(&ПодразделениеОрганизации)", " ") + "
	|ИНДЕКСИРОВАТЬ ПО
	|	РаботникиОрганизаций.Сотрудник";
    ЗапросТабель.Выполнить();
	
	// Запрос дат периода
	Если РабочаяДата < НачалоМесяца(ДатаНач) Тогда
		// формируем пустую таблицу
		ВозвращаемоеСообщениеОбОшибке = "Отчет можно формировать только за текущий или предыдущий периоды!";
		Возврат;
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		|	ДатаТабеля
		|	
		|ПОМЕСТИТЬ ВТДатыТабеля 
		|	ИЗ (
		|	ВЫБРАТЬ
		|	ДАТАВРЕМЯ(" + Формат(Год(ДатаНач), "ЧГ=4") + ", " + Месяц(ДатаНач) + " , 1) КАК ДатаТабеля
		|	";           
		Для НомерДня = 2 По День(Мин(РабочаяДата, КонецМесяца(ДатаНач))) Цикл
		ТекстЗапроса = ТекстЗапроса + 
			"ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|  ДАТАВРЕМЯ(" + Формат(Год(ДатаНач), "ЧГ=4")+ ", " + Месяц(ДатаНач) + " ," + НомерДня + ")
		|	";
		КонецЦикла;
		ТекстЗапроса = ТекстЗапроса + ") КАК ДатыТабеля";
	КонецЕсли;
	ЗапросТабель.Текст = ТекстЗапроса;
	ЗапросТабель.Выполнить();
		
	// Запрос Сотрудник, ДатыПериода
	ЗапросТабель.Текст = 
	"ВЫБРАТЬ
	|	Сотрудник,
	|	СотрудникНаименование,
	|	Организация,
	|	ПодразделениеОрганизации,
	|	Должность,
	|	ВТДатыТабеля.ДатаТабеля КАК ДатаТабеля
	|ПОМЕСТИТЬ ВТСотрудникДата
	|	ИЗ ВТСотрудники КАК Сотрудники
	|ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыТабеля
	|	ПО ИСТИНА 
	|ИНДЕКСИРОВАТЬ ПО
	|	СотрудникНаименование,
	|	ВТДатыТабеля.ДатаТабеля ";
	ЗапросТабель.Выполнить();
		
	ЗапросТабель.Текст = 
	"ВЫБРАТЬ
	|	РабочееВремяРаботниковОрганизаций.Сотрудник КАК Сотрудник,
	|	СУММА(РабочееВремяРаботниковОрганизаций.Часов) КАК Часов,
	|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени КАК ВидВремени,
	|	РабочееВремяРаботниковОрганизаций.Период КАК ДатаТабеля
	|	ПОМЕСТИТЬ ВТРабочеВремя
	|	ИЗ
	|	РегистрНакопления.РабочееВремяРаботниковОрганизаций КАК РабочееВремяРаботниковОрганизаций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники
	|	ПО РабочееВремяРаботниковОрганизаций.Сотрудник = ВТСотрудники.Сотрудник
	|	ГДЕ
	|	(НЕ РабочееВремяРаботниковОрганизаций.ВЦеломЗаПериод)
	|	И (НЕ РабочееВремяРаботниковОрганизаций.СводнаяЗапись)
	|	И НАЧАЛОПЕРИОДА(РабочееВремяРаботниковОрганизаций.Период, МЕСЯЦ) = &НачалоМесяца
	|	
	|	СГРУППИРОВАТЬ ПО
	|	РабочееВремяРаботниковОрганизаций.Сотрудник,
	|	РабочееВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени,
	|	РабочееВремяРаботниковОрганизаций.Период
	|	
	|	ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	ДатаТабеля	";				
	ЗапросТабель.Выполнить();
	
	ЗапросТабель.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФактическийПериодДействия.Сотрудник,
	|	ФактическийПериодДействия.ВидРасчета,
	|	ФактическийПериодДействия.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени КАК ВидВремени,
	|	ФактическийПериодДействия.ГрафикРаботы КАК ГрафикРаботы,
	|	ФактическийПериодДействия.ПериодДействияНачало,
	|	ФактическийПериодДействия.ПериодРегистрации,
	|	ФактическийПериодДействия.Сторно,
	|	ФактическийПериодДействия.ПериодДействияКонец,
	|	ФактическийПериодДействия.ОтработаноЧасов
	|	
	|	ПОМЕСТИТЬ ВТОсновныеНачисления
	|ИЗ
	|	РегистрРасчета.Начисления.ФактическийПериодДействия(Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)) КАК ФактическийПериодДействия
	|ГДЕ
	|	ПериодДействия = &НачалоМесяца
	|	И ФактическийПериодДействия.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &ВидВремениПустаяСсылка
	|";
	ЗапросТабель.Выполнить();
		
	ЗапросТабель.Текст = 
	"ВЫБРАТЬ
	|	ВТДатыТабеля.ДатаТабеля,
	|	Начисления.Сотрудник,
	|	Начисления.ВидРасчета,
	|	Начисления.ВидВремени,
	|	Начисления.ГрафикРаботы,
	|	ВЫБОР КОГДА Начисления.ВидВремени В (&ОтработаноСверхНормы) ТОГДА
	|		ВЫБОР КОГДА ВТДатыТабеля.ДатаТабеля = Начисления.ПериодДействияНачало ТОГДА
	|			Начисления.ОтработаноЧасов
	|		ИНАЧЕ
	|			0
	|		КОНЕЦ
	|	ИНАЧЕ
	|		NULL
	|	КОНЕЦ КАК ОтработаноЧасов
	|	
	|ПОМЕСТИТЬ ВТОтфильтрованныеОсновныеНачисления
	|ИЗ
	|	ВТДатыТабеля
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТОсновныеНачисления КАК Начисления
	|ПО
	|	ВТДатыТабеля.ДатаТабеля МЕЖДУ Начисления.ПериодДействияНачало И Начисления.ПериодДействияКонец
	|	И НЕ Начисления.Сторно
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	ВТОсновныеНачисления КАК СторноНачисления
	|ПО
	|	ВТДатыТабеля.ДатаТабеля МЕЖДУ СторноНачисления.ПериодДействияНачало И СторноНачисления.ПериодДействияКонец
	|	И СторноНачисления.Сторно
	|	И СторноНачисления.Сотрудник = Начисления.Сотрудник
	|	И СторноНачисления.ВидРасчета = Начисления.ВидРасчета
	|	И СторноНачисления.ГрафикРаботы = Начисления.ГрафикРаботы
	|	И СторноНачисления.ПериодРегистрации > Начисления.ПериодРегистрации
	|ГДЕ СторноНачисления.Сотрудник Есть NULL";
	ЗапросТабель.Выполнить();
	
	ЗапросТабель.Текст = "ВЫБРАТЬ
	|	Работники.Сотрудник КАК Сотрудник,
	|	Работники.Период,
	|	Работники.ГрафикРаботы,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ПериодЗавершения,
	|   NULL КАК ГрафикРаботыЗавершения
	|	ПОМЕСТИТЬ ВТГрафикиРаботниковСрез
	|	ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&НачалоМесяца, Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)" + ?(ПустаяСтрока(УсловиеНаОрганизации),""," И " + УсловиеНаОрганизации) + ") КАК Работники
	|	
	|	ИНДЕКСИРОВАТЬ ПО 
	|	Сотрудник,
	|	Период";
	ЗапросТабель.Выполнить();
	
	ЗапросТабель.Текст = "ВЫБРАТЬ
	|	Работники.Сотрудник КАК Сотрудник,
	|	&НачалоМесяца КАК Период,
	|	ВЫБОР КОГДА Работники.ПериодЗавершения <= &НачалоМесяца И Работники.ПериодЗавершения > &НачалоМесяца ТОГДА Работники.ГрафикРаботыЗавершения ИНАЧЕ Работники.ГрафикРаботы КОНЕЦ КАК ГрафикРаботы
	|	ПОМЕСТИТЬ ВТГрафикиРаботников
	|	ИЗ
	|	ВТГрафикиРаботниковСрез КАК Работники
	|	
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник,
	|	РаботникиОрганизаций.Период,
	|	РаботникиОрганизаций.ГрафикРаботы
	|	ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники
	|	ПО РаботникиОрганизаций.Сотрудник = ВТСотрудники.Сотрудник
	|	ГДЕ
	|	РаботникиОрганизаций.Период > &НачалоМесяца
	|	И РаботникиОрганизаций.Период <= &ОкончаниеМесяца
	|	
	|	
	|	ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период	";
	ЗапросТабель.Выполнить();
		
	ЗапросТабель.Текст = "ВЫБРАТЬ 
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
	|	Дата,
	|	ОсновноеЗначение,
	|	ВидУчетаВремени
	|	
	|	ПОМЕСТИТЬ ВТГрафикиРаботыПоВидамВремени
	|	ИЗ
	|		РегистрСведений.ГрафикиРаботыПоВидамВремени Как ГрафикиРаботыПоВидамВремени
	|	ГДЕ
	|		(ГрафикиРаботыПоВидамВремени.ГрафикРаботы В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники)
	|		ИЛИ ГрафикиРаботыПоВидамВремени.ГрафикРаботы В (ВЫБРАТЬ РАЗЛИЧНЫЕ ГрафикРаботы Из ВТГрафикиРаботников))	
	|		И (НАЧАЛОПЕРИОДА(Дата,МЕСЯЦ) = &НачалоМесяца) И ВидУчетаВремени <> &ПоДням
	|	ИНДЕКСИРОВАТЬ ПО
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы,
	|	ГрафикиРаботыПоВидамВремени.Дата,
	|	ГрафикиРаботыПоВидамВремени.ВидУчетаВремени";
	ЗапросТабель.Выполнить();
	
	ЗапросТабель.Текст = "ВЫБРАТЬ
	|	СостояниеРаботников.Сотрудник КАК Сотрудник,
	|	СостояниеРаботников.Период КАК Период,
	|	СостояниеРаботников.Состояние
	|	ПОМЕСТИТЬ ВТСостояниеРаботниковСрез
	|	ИЗ
	|	РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&НачалоМесяца, Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТСотрудники) " + ?(ПустаяСтрока(УсловиеНаОрганизации),""," И " + УсловиеНаОрганизации) + ") КАК СостояниеРаботников
	|	
	|	ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период";
	ЗапросТабель.Выполнить();
	
	ЗапросТабель.Текст = "ВЫБРАТЬ
	|	СостояниеРаботников.Сотрудник КАК Сотрудник,
	|	&НачалоМесяца 	КАК Период,
	|	СостояниеРаботников.Состояние КАК Состояние
	|	ПОМЕСТИТЬ ВТСостояниеРаботников
	|	ИЗ
	|	ВТСостояниеРаботниковСрез КАК СостояниеРаботников
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СостояниеРаботников.Сотрудник,
	|		СостояниеРаботников.Период,
	|		СостояниеРаботников.Состояние
	|	ИЗ
	|		РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники
	|		ПО СостояниеРаботников.Сотрудник = ВТСотрудники.Сотрудник
	|	ГДЕ
	|		СостояниеРаботников.Период > &НачалоМесяца
	|		И СостояниеРаботников.Период <= &ОкончаниеМесяца
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СостояниеРаботников.Сотрудник,
	|		СостояниеРаботников.Период,
	|		СостояниеРаботников.Состояние
	|	ИЗ
	|		РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСотрудники
	|			ПО СостояниеРаботников.Сотрудник = ВТСотрудники.Сотрудник
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК СостояниеРаботниковПроверка
	|			ПО СостояниеРаботниковПроверка.Сотрудник = СостояниеРаботников.Сотрудник
	|				И СостояниеРаботниковПроверка.Период > СостояниеРаботников.Период
	|	ГДЕ
	|		СостояниеРаботников.Период > &НачалоМесяца
	|		И СостояниеРаботников.Период <= &ОкончаниеМесяца
	|		И СостояниеРаботниковПроверка.Сотрудник ЕСТЬ NULL 
	|		
	|	ИНДЕКСИРОВАТЬ ПО
	|		Сотрудник,
	|		Период	";
	ЗапросТабель.Выполнить();
	
	ЗапросТабель.Текст = 
	"ВЫБРАТЬ 
	|		Основной.Сотрудник,
	|		ВЫБОР 
	|		 	КОГДА Основной.Состояние = &Заболевание ТОГДА &Больничный
	|		КОНЕЦ
	|		КАК ВидВремени,
	|		Основной.Период КАК ПериодНачало,
	|		ВЫБОР КОГДА МИНИМУМ(Вспомогательный.Период) ЕСТЬ NULL ТОГДА &ОкончаниеМесяца ИНАЧЕ ДОБАВИТЬКДАТЕ(МИНИМУМ(Вспомогательный.Период), СЕКУНДА, -1) КОНЕЦ КАК ПериодКонец
	|	
	|	ПОМЕСТИТЬ ВТСостояниеСотрудников
	|	
	|	ИЗ ВТСостояниеРаботников КАК Основной
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостояниеРаботников КАК Вспомогательный
	|		ПО Вспомогательный.Сотрудник = Основной.Сотрудник
	|		И Вспомогательный.Период > Основной.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Основной.Сотрудник,
	|		Основной.Состояние,
	|		Основной.Период
	|	
	|	ИНДЕКСИРОВАТЬ ПО
	|		Основной.Сотрудник,
	|		Основной.Период ";
	ЗапросТабель.Выполнить();
	
	ЗапросТабель.Текст = "ВЫБРАТЬ 
	|	Основной.Сотрудник,
	|	Основной.ГрафикРаботы,
	|	Основной.Период КАК ПериодНачало,
	|	ВЫБОР КОГДА МИНИМУМ(Вспомогательный.Период) ЕСТЬ NULL ТОГДА &ОкончаниеМесяца ИНАЧЕ ДОБАВИТЬКДАТЕ(МИНИМУМ(Вспомогательный.Период), СЕКУНДА, -1) КОНЕЦ КАК ПериодКонец
	|	
	|	ПОМЕСТИТЬ ВТГрафикиПериодами
	|	
	|	ИЗ ВТГрафикиРаботников КАК Основной
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботников КАК Вспомогательный
	|	ПО Вспомогательный.Сотрудник = Основной.Сотрудник
	|	И Вспомогательный.Период > Основной.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|	Основной.Сотрудник,
	|	Основной.ГрафикРаботы,
	|	Основной.Период
	|	
	|	ИНДЕКСИРОВАТЬ ПО
	|	Основной.Сотрудник,
	|	Основной.Период ";
	ЗапросТабель.Выполнить();
		
	ЗапросТабель.Текст = 
	"ВЫБРАТЬ
	|		НеотфильтрованноеВремя.Организация Как Организация,
	|		НеотфильтрованноеВремя.Организация.НаименованиеПолное Как ИмяОрганизации,
	|		НеотфильтрованноеВремя.ПодразделениеОрганизации Как ПодразделениеОрганизации,
	|		НеотфильтрованноеВремя.ПодразделениеОрганизации.Наименование Как ИмяПодразделения,
	|		НеотфильтрованноеВремя.Должность.Наименование Как Должность,
	|		НеотфильтрованноеВремя.Сотрудник,
	|		НеотфильтрованноеВремя.Сотрудник.Код КАК ТабельныйНомер,
	|		НеотфильтрованноеВремя.СотрудникНаименование,
	|		НеотфильтрованноеВремя.ДатаТабеля,
	|		НеотфильтрованноеВремя.ВидВремени,
	|		Выбор Когда НеотфильтрованноеВремя.ВидВремени.РабочееВремя Тогда
	|			ЕстьNULL(НеотфильтрованноеВремя.Часов, 0)
	|		Иначе 0 Конец Как Часов,
	|		Выбор Когда НЕ НеотфильтрованноеВремя.ВидВремени.РабочееВремя Тогда
	|			ЕстьNULL(НеотфильтрованноеВремя.Часов, 0)
	|		Иначе 0 Конец Как НеотработаноЧасов,
	|		Выбор 
	|			Когда НеотфильтрованноеВремя.ВидВремени = &Явка Тогда 1
	|			Когда НеотфильтрованноеВремя.ВидВремени = &ВечерниеЧасы Тогда 2
	|			Когда НеотфильтрованноеВремя.ВидВремени = &НочныеЧасы Тогда 3
	|			Когда НеотфильтрованноеВремя.ВидВремени = &Выходной Тогда 5
	|			Иначе 4
	|		Конец КАК ПолеСортировки 
	|		ИЗ (
	|		ВЫБРАТЬ РАЗЛИЧНЫЕ 
	|		ВТСотрудникДата.Организация Как Организация,
	|		ВТСотрудникДата.ПодразделениеОрганизации Как ПодразделениеОрганизации,
	|		ВТСотрудникДата.Должность,
	|		ВТСотрудникДата.Сотрудник Как Сотрудник,
	|		ВТСотрудникДата.СотрудникНаименование Как СотрудникНаименование,
	|		ВТСотрудникДата.ДатаТабеля КАК ДатаТабеля,
	|		ВЫБОР 
	|			КОГДА НЕ ВТРабочеВремя.ВидВремени ЕСТЬ NULL ТОГДА ВТРабочеВремя.ВидВремени
	|			КОГДА (НЕ ВТОсновныеНачисления.ВидВремени ЕСТЬ NULL ) ТОГДА 
	|				ВЫБОР 
	|					КОГДА ВТОсновныеНачисления.ВидВремени В (&НочныеЧасы, &ВечерниеЧасы) 
	|						И ГрафикПоОсновнымНачислениям.ОсновноеЗначение = 0 ТОГДА 
	|						   NULL
	|					КОГДА Не ВТОсновныеНачисления.ВидВремени В (&ЦелодневноеНеотработанное, &ОтработаноСверхНормы)
	|						И ГрафикПоОсновнымНачислениям.ОсновноеЗначение = 0 ТОГДА 
|								&Выходной
	|					ИНАЧЕ  ВТОсновныеНачисления.ВидВремени
	|				КОНЕЦ
	|			КОГДА НЕ ВТСостояниеСотрудников.ВидВремени ЕСТЬ NULL ТОГДА 
	|				ВЫБОР 
	|					КОГДА ГрафикПоСостояниюСотрудников.ОсновноеЗначение = 0 
	|						ИЛИ ИндивидуальныйГрафикПоСостояниюСотрудников.ОсновноеЗначение = 0 ТОГДА &Выходной
	|					ИНАЧЕ ВТСостояниеСотрудников.ВидВремени
	|				КОНЕЦ
	|			КОГДА НЕ ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени ЕСТЬ NULL ТОГДА
	|				ВЫБОР
	|					КОГДА ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени = &ПоНочнымЧасам ТОГДА &НочныеЧасы
	|					КОГДА ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени = &ПоВечернимЧасам ТОГДА &ВечерниеЧасы
	|					КОГДА ИндивидуальныйГрафикПоРаботникам.ОсновноеЗначение = 0 ТОГДА &Выходной
	|					ИНАЧЕ &Явка
	|				КОНЕЦ
	|			КОГДА НЕ ГрафикПоРаботникам.ВидУчетаВремени ЕСТЬ NULL ТОГДА
	|				ВЫБОР
	|					КОГДА ГрафикПоРаботникам.ВидУчетаВремени = &ПоНочнымЧасам ТОГДА &НочныеЧасы
	|					КОГДА ГрафикПоРаботникам.ВидУчетаВремени = &ПоВечернимЧасам ТОГДА &ВечерниеЧасы
	|					КОГДА ГрафикПоРаботникам.ОсновноеЗначение = 0 ТОГДА &Выходной
	|					ИНАЧЕ &Явка
	|				КОНЕЦ
	|			ИНАЧЕ &Выходной
	|		КОНЕЦ КАК ВидВремени,
	|		ВЫБОР 
	|			КОГДА НЕ ВТОсновныеНачисления.ОтработаноЧасов ЕСТЬ NULL ТОГДА ВТОсновныеНачисления.ОтработаноЧасов	
	|			КОГДА НЕ ВТРабочеВремя.Часов ЕСТЬ NULL ТОГДА ВТРабочеВремя.Часов
	|			КОГДА НЕ ГрафикПоОсновнымНачислениям.ОсновноеЗначение ЕСТЬ NULL ТОГДА ГрафикПоОсновнымНачислениям.ОсновноеЗначение
	|			КОГДА НЕ ИндивидуальныйГрафикПоСостояниюСотрудников.ОсновноеЗначение ЕСТЬ NULL ТОГДА ИндивидуальныйГрафикПоСостояниюСотрудников.ОсновноеЗначение
	|			КОГДА НЕ ГрафикПоСостояниюСотрудников.ОсновноеЗначение ЕСТЬ NULL ТОГДА ГрафикПоСостояниюСотрудников.ОсновноеЗначение
	|			КОГДА НЕ ИндивидуальныйГрафикПоРаботникам.ОсновноеЗначение ЕСТЬ NULL ТОГДА ИндивидуальныйГрафикПоРаботникам.ОсновноеЗначение
	|			КОГДА НЕ ГрафикПоРаботникам.ОсновноеЗначение ЕСТЬ NULL ТОГДА ГрафикПоРаботникам.ОсновноеЗначение
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Часов
	|	ИЗ ВТСотрудникДата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРабочеВремя
	|		ПО ВТРабочеВремя.Сотрудник = ВТСотрудникДата.Сотрудник
	|		И ВТРабочеВремя.ДатаТабеля = ВТСотрудникДата.ДатаТабеля
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиПериодами
	|		ПО ВТГрафикиПериодами.Сотрудник = ВТСотрудникДата.Сотрудник
	|		И ВТСотрудникДата.ДатаТабеля >= ВТГрафикиПериодами.ПериодНачало
	|		И ВТСотрудникДата.ДатаТабеля <= ВТГрафикиПериодами.ПериодКонец
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтфильтрованныеОсновныеНачисления Как ВТОсновныеНачисления
	|		ПО ВТСотрудникДата.Сотрудник = ВТОсновныеНачисления.Сотрудник
	|			И ВТСотрудникДата.ДатаТабеля = ВТОсновныеНачисления.ДатаТабеля
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ГрафикПоОсновнымНачислениям
	|		ПО ГрафикПоОсновнымНачислениям.ГрафикРаботы = ВТОсновныеНачисления.ГрафикРаботы
	|		И ГрафикПоОсновнымНачислениям.Дата =  ВТСотрудникДата.ДатаТабеля
	|		И ВЫБОР 
	|			КОГДА ВТОсновныеНачисления.ВидВремени = &НочныеЧасы ТОГДА &ПоНочнымЧасам
	|			КОГДА ВТОсновныеНачисления.ВидВремени = &ВечерниеЧасы ТОГДА &ПоВечернимЧасам
	|			ИНАЧЕ &ПоЧасам 
	|		КОНЕЦ = ГрафикПоОсновнымНачислениям.ВидУчетаВремени
	|		И НЕ ВТОсновныеНачисления.ВидВремени ЕСТЬ NULL
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСостояниеСотрудников
	|		ПО ВТСотрудникДата.Сотрудник = ВТСостояниеСотрудников.Сотрудник
	|		И ВТСотрудникДата.ДатаТабеля >= ВТСостояниеСотрудников.ПериодНачало
	|		И ВТСотрудникДата.ДатаТабеля <= ВТСостояниеСотрудников.ПериодКонец
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ИндивидуальныйГрафикПоСостояниюСотрудников
	|		ПО ИндивидуальныйГрафикПоСостояниюСотрудников.ГрафикРаботы = ВТСотрудникДата.Сотрудник
	|		И ИндивидуальныйГрафикПоСостояниюСотрудников.Дата =  ВТСотрудникДата.ДатаТабеля
	|		И ВЫБОР 
	|			КОГДА ВТСостояниеСотрудников.ВидВремени = &НочныеЧасы ТОГДА &ПоНочнымЧасам
	|			КОГДА ВТСостояниеСотрудников.ВидВремени = &ВечерниеЧасы ТОГДА &ПоВечернимЧасам
	|			ИНАЧЕ &ПоЧасам 
	|		КОНЕЦ = ИндивидуальныйГрафикПоСостояниюСотрудников.ВидУчетаВремени
	|		И НЕ ВТСостояниеСотрудников.ВидВремени ЕСТЬ NULL
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ГрафикПоСостояниюСотрудников
	|		ПО ГрафикПоСостояниюСотрудников.ГрафикРаботы = ВТОсновныеНачисления.ГрафикРаботы
	|		И ГрафикПоСостояниюСотрудников.Дата =  ВТСотрудникДата.ДатаТабеля
	|		И ВЫБОР
	|			КОГДА ВТСостояниеСотрудников.ВидВремени = &НочныеЧасы ТОГДА &ПоНочнымЧасам
	|			КОГДА ВТСостояниеСотрудников.ВидВремени = &ВечерниеЧасы ТОГДА &ПоВечернимЧасам
	|			ИНАЧЕ &ПоЧасам 
	|		КОНЕЦ = ГрафикПоСостояниюСотрудников.ВидУчетаВремени
	|		И НЕ ВТСостояниеСотрудников.ВидВремени ЕСТЬ NULL 
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийПриемы
	|		ПО РаботникиОрганизацийПриемы.Сотрудник = ВТСотрудникДата.Сотрудник
	|		И РаботникиОрганизацийПриемы.ПричинаИзмененияСостояния = &ПриемНаРаботу
	|		И РаботникиОрганизацийПриемы.Период <= ВТСотрудникДата.ДатаТабеля
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизацийУвольнения
	|		ПО РаботникиОрганизацийУвольнения.Сотрудник = ВТСотрудникДата.Сотрудник
	|		И РаботникиОрганизацийУвольнения.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ИндивидуальныйГрафикПоРаботникам
	|		ПО ИндивидуальныйГрафикПоРаботникам.ГрафикРаботы = ВТСотрудникДата.Сотрудник
	|		И ИндивидуальныйГрафикПоРаботникам.Дата =  ВТСотрудникДата.ДатаТабеля
	|		И ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени <> &ПоДням
	|		И не((ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени В (&ПоВечернимЧасам,&ПоНочнымЧасам))
	|			И  (ИндивидуальныйГрафикПоРаботникам.ОсновноеЗначение = 0))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрафикиРаботыПоВидамВремени КАК ГрафикПоРаботникам
	|		ПО ГрафикПоРаботникам.ГрафикРаботы = ВТГрафикиПериодами.ГрафикРаботы
	|		И ГрафикПоРаботникам.Дата =  ВТСотрудникДата.ДатаТабеля
	|		И ГрафикПоРаботникам.ВидУчетаВремени <> &ПоДням
	|		И ((ГрафикПоРаботникам.ВидУчетаВремени = ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени)
	|			ИЛИ (ИндивидуальныйГрафикПоРаботникам.ГрафикРаботы ЕСТЬ NULL))
	|		И не((ГрафикПоРаботникам.ВидУчетаВремени В (&ПоВечернимЧасам,&ПоНочнымЧасам))
	|			И  (ГрафикПоРаботникам.ОсновноеЗначение = 0))
	|	
	|	ГДЕ (РаботникиОрганизацийУвольнения.Период ЕСТЬ NULL
	|	ИЛИ РаботникиОрганизацийУвольнения.Период > ВТСотрудникДата.ДатаТабеля)
	|	И   не
	|	(НЕ ВЫБОР 
	|			КОГДА НЕ ВТРабочеВремя.ВидВремени ЕСТЬ NULL ТОГДА ВТРабочеВремя.ВидВремени
	|			КОГДА НЕ ВТОсновныеНачисления.ВидВремени ЕСТЬ NULL ТОГДА 
	|				ВЫБОР 
	|					КОГДА ВТОсновныеНачисления.ВидВремени В (&НочныеЧасы, &ВечерниеЧасы) 
	|						И ГрафикПоОсновнымНачислениям.ОсновноеЗначение = 0 ТОГДА 
	|						   NULL
	|					КОГДА НЕ ВТОсновныеНачисления.ВидВремени В (&ЦелодневноеНеотработанное)
	|						И ГрафикПоОсновнымНачислениям.ОсновноеЗначение = 0 ТОГДА
	|							&Выходной
	|					ИНАЧЕ  ВТОсновныеНачисления.ВидВремени
	|				КОНЕЦ	
	|			КОГДА НЕ ВТСостояниеСотрудников.ВидВремени ЕСТЬ NULL ТОГДА 
	|				ВЫБОР 
	|					КОГДА ГрафикПоСостояниюСотрудников.ОсновноеЗначение = 0 
	|						ИЛИ ИндивидуальныйГрафикПоСостояниюСотрудников.ОсновноеЗначение = 0 ТОГДА &Выходной
	|					ИНАЧЕ ВТСостояниеСотрудников.ВидВремени
	|				КОНЕЦ
	|			КОГДА НЕ ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени ЕСТЬ NULL ТОГДА
	|				ВЫБОР
	|					КОГДА ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени = &ПоНочнымЧасам ТОГДА &НочныеЧасы
	|					КОГДА ИндивидуальныйГрафикПоРаботникам.ВидУчетаВремени = &ПоВечернимЧасам ТОГДА &ВечерниеЧасы
	|					КОГДА ИндивидуальныйГрафикПоРаботникам.ОсновноеЗначение = 0 ТОГДА &Выходной
	|					ИНАЧЕ &Явка
	|				КОНЕЦ
	|			КОГДА НЕ ГрафикПоРаботникам.ВидУчетаВремени ЕСТЬ NULL ТОГДА
	|				ВЫБОР
	|					КОГДА ГрафикПоРаботникам.ВидУчетаВремени = &ПоНочнымЧасам ТОГДА &НочныеЧасы
	|					КОГДА ГрафикПоРаботникам.ВидУчетаВремени = &ПоВечернимЧасам ТОГДА &ВечерниеЧасы
	|					КОГДА ГрафикПоРаботникам.ОсновноеЗначение = 0 ТОГДА &Выходной
	|					ИНАЧЕ &Явка
	|				КОНЕЦ
	|			ИНАЧЕ &Выходной
	|		КОНЕЦ В ( &Явка, &НочныеЧасы, &ВечерниеЧасы) 
	|		И
	|		ГрафикПоРаботникам.ВидУчетаВремени В (&ПоНочнымЧасам, &ПоВечернимЧасам) )
	|	) КАК НеотфильтрованноеВремя
	|	ГДЕ НЕ НеотфильтрованноеВремя.ВидВремени Есть NULL
	|УПОРЯДОЧИТЬ ПО
	|	Организация, ПодразделениеОрганизации, СотрудникНаименование, Сотрудник, Должность, ДатаТабеля, ПолеСортировки";	
	РезультатЗапроса = ЗапросТабель.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщить(НСтр("ru='Данные не обнаружены!';uk='Дані не знайдені!'"));
		Возврат;
		
	КонецЕсли;
	
	Макет 		= ПолучитьМакет("П13");
	
	ОбластьДанныхШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьДанныхКолонтитул = Макет.ПолучитьОбласть("Колонтитул");
	ОбластьДанныхСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьДанныхПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ОбластьДанныхШапка.Параметры.ПериодОтчета = "за " + Формат(ДатаНач, "Л=uk_UA; ДФ='MMMM yyyy'");
	
	ПараметровВстроке = ОбластьДанныхСтрока.Параметры.Количество();

	Классификатор = Справочники.КлассификаторИспользованияРабочегоВремени;
	
	ВыборкаПоСотр = РезультатЗапроса.Выбрать();
	Явка = Классификатор.Работа;

	СоответствиеЦелодневныхНевыходов = Новый Соответствие;
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.Командировка,                                 0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ПовышениеКвалификации,                        0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ДопризывнаяПодготовка,                        0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ОсновнойОтпуск,                               0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ВоенныеСборы,                                 0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ОтпускНаОбучение,                             0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ОтпускНаОбучениеНеоплачиваемый,               0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ОтпускПоБеременностиИРодам,                   0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ОтпускПоУходуЗаРебенком,                      0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.НеоплачиваемыйОтпускПоРазрешениюРаботодателя, 0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.НеоплачиваемыйОтпускПоЗаконодательству,       0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.УчебаБезСохраненияЗП,                         0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.Болезнь,                                      0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.БолезньБезОплаты,                             0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ЖенщинамНаКормлениеДетей,                     0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ГосударственныеОбязанности,                   0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ВыходныеДни,                                  0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.Карантин,                                     0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.Забастовка,                                   0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.НеявкиПоНевыясненнымПричинам,                 0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.Простой,                    0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ПростойПоВинеРаботодателяВнутрисменный,       0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ПростоиПоВинеРаботниковВнутрисменные,         0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.ПростоиПоВинеРаботников,                      0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.Командировка,                                 0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.КомандировкаСельхозРаботы,                    0);
	СоответствиеЦелодневныхНевыходов.Вставить(Классификатор.КомандировкаСельхозРаботы75,                  0);
	
	МассивКодов = Новый Массив;
	
	Для каждого Элемент Из СоответствиеЦелодневныхНевыходов Цикл
		
		МассивКодов.Добавить(Элемент.Ключ)
		
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",МассивКодов);
	Запрос.Текст = "ВЫБРАТЬ
	                      |	КлассификаторИспользованияРабочегоВремени.Ссылка       КАК Ссылка,
	                      |	КлассификаторИспользованияРабочегоВремени.БуквенныйКод КАК БуквенныйКод
	                      |ИЗ
	                      |	Справочник.КлассификаторИспользованияРабочегоВремени 
						  |	           КАК КлассификаторИспользованияРабочегоВремени
	                      |
	                      |ГДЕ
	                      |	КлассификаторИспользованияРабочегоВремени.Ссылка В(&Ссылка)";
						  
	Выборка = Запрос.Выполнить().Выбрать();
	ВыборкаПоРаботнику = РезультатЗапроса.Выбрать();

	
	СоответствиеЦелодневныхНевыходов = Новый Соответствие;
	СоответствиеЦелодневныхНевыходовЧасы = Новый Соответствие;

	СоответствиеКодовЦелодневныхНевыходов = Новый Соответствие;
	СписокПоказателей = Новый СписокЗначений;
	СписокПоказателей.Добавить("","КодПоЕДРПОУ");
	
	Пока Выборка.Следующий() Цикл
		
		СоответствиеКодовЦелодневныхНевыходов.Вставить(Выборка.Ссылка,Выборка.БуквенныйКод)
		
	КонецЦикла;
	
	
	
	Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Организация") Цикл
				
				Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("ПодразделениеОрганизации") Цикл
					Если ДокументРезультат.ВысотаТаблицы > 0 Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;
					
					НомерПП = 0;
					ОбластьДанныхШапка.Параметры.Заполнить(ВыборкаПоРаботнику);
					
					КодЕДРПОУ = РегламентированнаяОтчетность.ПолучитьСведенияОбОрганизации(ВыборкаПоРаботнику.Организация, КонецМесяца(ДатаНач), СписокПоказателей).КодПоЕДРПОУ;
					КодЕДРПОУ = РазбитьСтрокуНаСимволы(СокрЛП(КодЕДРПОУ), "ЕДРПОУ");
					
					Для каждого Рисунок Из ОбластьДанныхШапка.Рисунки Цикл
						
						Цифра = "";
						
						Если КодЕДРПОУ.Свойство(Рисунок.Имя, Цифра) Тогда
							
							Рисунок.Текст = Цифра;
							
						Иначе
							
							Рисунок.Текст = " ";
							
						КонецЕсли;
						
					КонецЦикла;
					
					
					ДокументРезультат.Вывести(ОбластьДанныхШапка);
					ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
					Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("СотрудникНаименование") Цикл
						Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("Сотрудник") Цикл
							
							НомерПП = НомерПП + 1;
							
							ДниПерваяПоловина  = 0;
							ЧасыПерваяПоловина = 0;
							ДниВтораяПоловина  = 0;
							ЧасыВтораяПоловина = 0;
							
							Для Сч = 1 По ПараметровВстроке Цикл
								ОбластьДанныхСтрока.Параметры.Установить(Сч - 1,""); 
							КонецЦикла;
							СоответствиеЦелодневныхНевыходов.Очистить();
							СоответствиеЦелодневныхНевыходовЧасы.Очистить();
							
							ОбластьДанныхСтрока.Параметры.НомерПП = НомерПП;
							ОбластьДанныхСтрока.Параметры.ФИО = СокрП(ВыборкаПоРаботнику.СотрудникНаименование);
							ОбластьДанныхСтрока.Параметры.Должность = ВыборкаПоРаботнику.Должность;
							ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоРаботнику);
							
							Пока ВыборкаПоРаботнику.СледующийПоЗначениюПоля("ДатаТабеля") Цикл
								
								СимволДня = ""; ОтработаноЧасовЗаДень = 0;
								ОтработаноЧасовЗаДеньСтр = "";
								НомерДня = Строка(День(ВыборкаПоРаботнику.ДатаТабеля));
								ПерваяПоловина = День(ВыборкаПоРаботнику.ДатаТабеля) <= 15;
								УчитыватьВыходнойДень = Истина;
								
								Пока ВыборкаПоРаботнику.Следующий() Цикл
											
									//Если ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Праздники Тогда
									//	УчитыватьВыходнойДень = Ложь;
									Если ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни И НЕ УчитыватьВыходнойДень Тогда
										Продолжить;
									КонецЕсли;
									
									БуквенныйКод = ВыборкаПоРаботнику.ВидВремени.БуквенныйКод;
									СимволДня = СимволДня + "/" + БуквенныйКод;
																		
									Если НЕ(ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Вечерние
										ИЛИ ВыборкаПоРаботнику.ВидВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Ночные) 
										И ВыборкаПоРаботнику.ВидВремени.РабочееВремя Тогда
										
										ОтработаноЧасовЗаДень = ОтработаноЧасовЗаДень + ВыборкаПоРаботнику.Часов;
										ОтработаноЧасовЗаДеньСтр = ОтработаноЧасовЗаДеньСтр + "/" + Строка(ВыборкаПоРаботнику.Часов);
									ИначеЕсли ВыборкаПоРаботнику.ВидВремени.РабочееВремя Тогда
										ОтработаноЧасовЗаДеньСтр = ОтработаноЧасовЗаДеньСтр + "/" + Строка(ВыборкаПоРаботнику.Часов);
									КонецЕсли;
									
									Если (НЕ ВыборкаПоРаботнику.ВидВремени.РабочееВремя)
										И (ВыборкаПоРаботнику.ВидВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.ВыходныеДни)Тогда
										Если  СоответствиеЦелодневныхНевыходов.Получить(БуквенныйКод) = Неопределено Тогда
											СоответствиеЦелодневныхНевыходов.Вставить(БуквенныйКод,  1);
											СоответствиеЦелодневныхНевыходовЧасы.Вставить(БуквенныйКод, ВыборкаПоРаботнику.НеотработаноЧасов);
										Иначе
											СоответствиеЦелодневныхНевыходов.Вставить(БуквенныйКод,  1 + СоответствиеЦелодневныхНевыходов.Получить(БуквенныйКод));
											СоответствиеЦелодневныхНевыходовЧасы.Вставить(БуквенныйКод, ВыборкаПоРаботнику.НеотработаноЧасов + СоответствиеЦелодневныхНевыходовЧасы.Получить(БуквенныйКод));
										КонецЕсли;
									КонецЕсли;
									
								КонецЦикла;	
								СимволДня = Сред(СимволДня, 2);
								ОтработаноЧасовЗаДеньСтр = Сред(ОтработаноЧасовЗаДеньСтр, 2);
								ОбластьДанныхСтрока.Параметры["Символ"+НомерДня] = СимволДня;
								ОбластьДанныхСтрока.Параметры["ДополнительноеЗначение"+НомерДня] = Формат(ОтработаноЧасовЗаДеньСтр);
								
								Если ОтработаноЧасовЗаДень <> 0 Тогда
									Если ПерваяПоловина Тогда
										ДниПерваяПоловина = ДниПерваяПоловина + 1;
										ЧасыПерваяПоловина = ЧасыПерваяПоловина + ОтработаноЧасовЗаДень
									Иначе
										ДниВтораяПоловина = ДниВтораяПоловина + 1;
										ЧасыВтораяПоловина = ЧасыВтораяПоловина + ОтработаноЧасовЗаДень
									КонецЕсли;
								КонецЕсли;
							КонецЦикла;
							
							//	заполняем раздел "Отработано за"
							ОбластьДанныхСтрока.Параметры.ДниПерваяПоловина  = ДниПерваяПоловина;
							ОбластьДанныхСтрока.Параметры.ЧасыПерваяПоловина = ЧасыПерваяПоловина;
							ОбластьДанныхСтрока.Параметры.ДниЗаМесяц  = ДниПерваяПоловина + ДниВтораяПоловина;
							ОбластьДанныхСтрока.Параметры.ЧасыЗаМесяц = ЧасыПерваяПоловина + ЧасыВтораяПоловина;
							
							// заполняем раздел "Неявки по причинам"
							СчНеявок = 0;
							Для каждого Элемент Из СоответствиеЦелодневныхНевыходов Цикл
								Если (Элемент.Значение > 0) ИЛИ СоответствиеЦелодневныхНевыходовЧасы.Получить(Элемент.Ключ) > 0 Тогда
									СчНеявок = СчНеявок + 1;
									ОбластьДанныхСтрока.Параметры["НеявкаКод" + Строка(СчНеявок)] = Элемент.Ключ;
									КоличествоЧасов = Строка(СоответствиеЦелодневныхНевыходовЧасы.Получить(Элемент.Ключ));
									ОбластьДанныхСтрока.Параметры["НеявкаДни" + Строка(СчНеявок)] = Формат(Элемент.Значение);
									ОбластьДанныхСтрока.Параметры["НеявкаЧасы" + Строка(СчНеявок)] = КоличествоЧасов;
								КонецЕсли;
							КонецЦикла; 
							
							// Проверим, уместится ли строка на странице или надо открывать новую страницу
							Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхСтрока) Тогда
								ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
							КонецЕсли;
							
							ДокументРезультат.Вывести(ОбластьДанныхСтрока);
							
						КонецЦикла;
					КонецЦикла;
					Если Не ДокументРезультат.ПроверитьВывод(ОбластьДанныхПодвал) Тогда
						ПоследняяСтрокаЛиста = ДокументРезультат.ПолучитьОбласть(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,);
						ДокументРезультат.УдалитьОбласть(ДокументРезультат.Область(ДокументРезультат.ВысотаТаблицы - 3,,ДокументРезультат.ВысотаТаблицы,),);
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						ДокументРезультат.Вывести(ОбластьДанныхКолонтитул);
						ДокументРезультат.Вывести(ПоследняяСтрокаЛиста);
					КонецЕсли;
					ДокументРезультат.Вывести(ОбластьДанныхПодвал);
				КонецЦикла;
				
			КонецЦикла;	
 

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

#КонецЕсли
